[
 {
        "date": "2024-09-15 01:55:23 UTC",
        "developer": "Jaedraze aka Jimbobbityboo",
        "content": "We have begun Developing our first twitch game called C.O.S",
        "points": [
            "- this is just a placeholder example",
			"- still very early in development but we hope to have a fully functional update example!"
        ]
    },
 {
        "date": "2024-06-24 04:35:48 UTC",
        "developer": "Jaedraze aka Jimbobbityboo",
        "content": "The Entropia Item Stash Tool Pricelist creation is being overhauled",
        "points": [
            "- pointa",
			"- pointb",
			"- pointc",
			"- long sentence with words and stuff or comment, can be used here"
        ]
    },
 {
        "date": "2024-06-20 6:37:30 UTC",
        "developer": "Jaedraze aka Jimbobbityboo",
        "content": "Made some small fixes and changes to pretend update",
        "points": [
            "- The copy fancy html button to copy pricelist html including js functionality has been modified so it now appears in a text box. the user must now copy it themselves, this was done due to the limitations of the  js functionality to copy straight to clipboard being surpassed",
			"- The restock,edit,sell buttons will now be disabled until the user clicks the load stash button and an item stash has been succesfully loaded. this is required because currently it will not function properly before loading a saved item stash. which should be expected. but now a user might understand this more intuitively with these changes",
			"- all aspects of the tool should now have basic functionality working properly...hopefully."
        ]
    },
 {
        "date": "2024-06-19 10:42:10 UTC",
        "developer": "Jaedraze aka Jimbobbityboo",
        "content": "i fixed some of the appearance of some elements in the sus os",
        "points": [
            "entropia item stash tool subwindows background is no longer completely transparant,it's easier to see inputs now ",
            "started fixing entropia calender appearance, fullcalender css styling is a pain in the ass to mess with. I'm not finished yet,hopefully tomorrow."
        ]
    },
 {
        "date": "2024-06-17 09:45:12 UTC",
        "developer": "Jaedraze aka General Jimbobbityboo",
        "content": "I've attempted to add a script to handle posting updates for me, we should see how it went by now.",
        "points": [
            "-currently updates should by automatically updated",
            "annd now I just need to automatically create them directly in the website, I'll come back to that..."
        ]
    },
 {
        "date": "2024-06-17 06:35:25 UTC",
        "developer": "Jaedraze aka General Jimbobbityboo",
        "content": "I've made a ton of changes and fixes.Perhaps il give a full note on it all later after I finish making the devnotesupdate thing functional...probably not... but the main points are:",
        "points": [
            "added the entropia chat .log file search tool to the O.S.",
            "added custom youtube player buttons and sound settings window for easier music control",
			"added a stopwatch",
			"made some improvements to the timer",
			"seemingly fixed the stashmanager, (untested- and plans to improve/overhaul it)",
			"made the background sparkly",
			"improved website structure slightly"
        ]
    },
    {
        "date": "2024-05-16 06:06:12 UTC",
        "developer": "Jaedraze aka General Jimbobbityboo of Secret Universal Services Society",
        "content": "Our main goal is to provide a comprehensive assistant platform for colonists in the Entropia system, offering a range of tools, information, and resources to enrich their gaming experience. While our current focus is on Planet Arkadia, we intend to gradually expand to include content regarding other planets and celestial bodies within Entropia Universe.",
        "points": [
            "I've added a YouTube embed for music. Scroll down to learn more!",
            "Update main page content - Scheduled for [Insert Deadline]"
        ]
    },
    {
        "date": "2024-05-16 06:06:12 UTC",
        "developer": "Jaedraze aka General Jimbobbityboo",
        "content": "You can add songs or videos to the playlist by following this link:",
        "points": [
            "https://www.youtube.com/playlist?list=PL1o56KF-RJwybHfromYguW0Vk9R0In7Ss&jct=1HjZpUGdnwSWLgr5B3y5p-9IcSsRsg",
            "a more convenient button will be added to add songs soon!"
        ]
    }
]